#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_DEV.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/1798203d-027f-4856-a445-8a90c1dc9756]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/270966e6-985c-4d55-a35c-53e32ab4cf46]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DBA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/9ada1d3b-be63-40a3-84f2-e4ec0e10be88]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/eb2dce73-6fe7-4b63-8b7a-c5995a530714]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/053fa749-b569-4258-bc9e-bc8ca0541dfe]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/4e3d322a-fbe7-438d-8ee7-95a1707d40dc]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRIMARY-CARE.module.client-roles.keycloak_role.ROLES["HealthlinkBC_PharmacistLead"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "51db4dfe-9de1-487c-9467-639e8e4e60d9"
        name       = "HealthlinkBC_PharmacistLead"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRIMARY-CARE.module.client-roles.keycloak_role.ROLES["PC_NavigatorLead"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "81d98a2c-25fb-4bec-a1a8-f993183fff21"
        name       = "PC_NavigatorLead"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.FLORIZEL-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "FLORIZEL Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FLORIZEL-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = [
          + "197b2f83-cdec-4585-939f-bc19bebdf802",
          + "25b73a09-5c9f-40a7-914e-c1108c61cc2e",
          + "414d1083-7d48-42e3-84d9-c9e6cf4b9b89",
          + "767bb2ee-f967-4718-ad7e-6414880253a2",
          + "79885676-48f2-43af-ade4-bc4f11d95f61",
          + "c90a0b28-ec61-4fc7-9ea1-fe05a269a37e",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "FLORIZEL Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FLORIZEL-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = [
          + "06799768-828d-4299-832b-0cc7a56684b0",
          + "35200f70-43c9-4489-9098-15bc81281a83",
          + "68933fe3-7eb8-44d8-b020-beeb54fade3d",
          + "868d5e32-f336-446b-9e90-830fc5debd38",
          + "8bea7469-b2b6-4799-b914-91ee2221a15a",
          + "b05e8da8-3737-4684-8523-612d902deaa2",
          + "cc8e2983-2eee-4f21-b47e-4953d272a4fd",
        ]
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*